#!/usr/bin/rexx
/*
 af Peter Stubbe <stubbe@bitnisse.dk>
 $Id$

 Programmet er skrevet til Regina Rexx
 http://www.radiks.net/~jmthomas/regina/Regina%20REXX.htm

 Afvikling:
  ./hello.rexx
*/

say 'Hello, world!'
