<CHAPTER ID="IT-STRATEGI"><TITLE>IT-strategi</TITLE>
<PARA>I dette kapitel vil det v&aelig;re hensigten, at vi f&aring;r opstillet en strategi for implementering af Linux som it-platform i en virksomhed. Du vil ikke f&aring; en f&aelig;rdigpakket l&oslash;sning, men derimod vil du med fordel kunne bruge kapitlet som et opslagv&aelig;rk, n&aring;r du skal udarbejde din egen it-strategi, som vil v&aelig;re grundlaget for firmaets skift til Linux som it-platform.
</PARA>
<PARA>N&aring;r man skal foretage st&oslash;rre it-&aelig;ndringer i sin virksomhed, vil det v&aelig;re en fordel for alle ber&oslash;rte parter, hvis &aelig;ndringen foreg&aring;r efter en n&aelig;je fastlagt plan, som tager hensyn til b&aring;de virksomhedens organisation og forretningsgange. Til dette form&aring;l findes der en r&aelig;kke &aelig;ndringsstrategier, som man med fordel kan tage i anvendelse allerede p&aring; planl&aelig;gningsstadiet. Fordelene ved at benytte en &aelig;ndringsstrategi er store, da man for det f&oslash;rste kan drage nytte af andres erfaringer, og dern&aelig;st sikre den valgte strategi, at man har et samlet plan for, hvordan man skal gennemf&oslash;re &aelig;ndringen.</PARA>
<SECT1 ID="MODEL"><TITLE>En &aelig;ndringsmodel</TITLE>
<PARA>Den &aelig;ndringsstrategi jeg vil basere resten af denne bog p&aring;, er inspireret af den velkendte model af H. J. Leavitt, som f&oslash;rste gang blev pr&aelig;senteret i artiklen <ABBREV>Applied organizational change in Industry</ABBREV>. Til lejligheden har jeg dog tilladt mig at benytte andre variable, da fukus for denne bog er, at (p&aring;)vise hvordan et skift af it-platform fra Windows til Linux bedst gennemf&oslash;res, og hvilke overvejelser man skal g&oslash;re sig, inden man tr&aelig;ffer sit valg.</PARA>
<PARA>Jeg vil nu kort pr&aelig;sentere bogens &aelig;ndringsstrategi, og samtidig vil jeg forklare strategiens forklaringsvariable og analyseniveau. Modellen kan vises grafisk p&aring; to m&aring;der:
</PARA>
<ITEMIZEDLIST MARK="number"><LISTITEM><PARA>Den traditionelle Leavittsdiamant. Se <XREF LINKEND="LEAVITT-FIG">.</PARA></LISTITEM>
<LISTITEM><PARA>Den traditionelle niveaudeling. Se <XREF LINKEND="NIVEAU-FIG"></PARA></LISTITEM></ITEMIZEDLIST>
<FIGURE FLOAT="1" ID="LEAVITT-FIG"><TITLE>&AElig;ndringsstrategien i Leavittsstil</TITLE>
<GRAPHIC FILEREF="leavitt.&magic;" SCALE="60"></GRAPHIC></FIGURE>
<PARA>Som man kan se af ovenst&aring;ende figur, operere vi med fire forklaringsvariable: Brugervenlighed, Drift, Sikkerhed og &Oslash;konomi, og hver af vores variable har sit fokus forskellige steder i organisationen. Sikkerhed og drift vil v&aelig;re h&oslash;jt prioriter af IT-afdelingen, mens medarbejderne nok har mest fokus p&aring; brugervenlighed. Ledelsen derimod er nok mest interesseret i sp&oslash;rgsm&aring;let om &oslash;konomi og sikkerhed. I de f&oslash;lgende afsnit vil de fire forklaringsvariable blive gennemg&aring;et, og i slutningen af hvert afsnit vil variablen blive operationaliseret</PARA>
<FIGURE FLOAT="1" ID="NIVEAU-FIG"><TITLE>&AElig;ndringsstrategien i niveaudelingsstil</TITLE>
<GRAPHIC FILEREF="niveau.&magic;" SCALE="60"></GRAPHIC></FIGURE>
<PARA>Af ovenst&aring;ende figur fremg&aring;r det, at vores analyseniveau befinder sig p&aring; det operationelle og taktiske niveau, og alts&aring; ikke indbefatter strategiske overvejelser. Dette h&aelig;nger sammen med, at jeg ikke ser det som en strategisk beslutning at v&aelig;lge, hvordan ens medarbejdere skal udf&oslash;re et bestemt stykke arbejde, men mere h&aelig;nger sammen med hvordan man f&aring;r det daglige arbejde udf&oslash;rt, og hvordan virksomhedens beslutninger konkret udm&oslash;nter sig i en forretningsgang. At jeg ikke forbinder de fire variable med strategiske beslutninger, betyder ikke, at du skal fritages for at tage strategiske beslutninger, tv&aelig;rtimod, skiftet fra en it-platform til en anden er i alder h&oslash;jeste grad en strategisk beslutning, men n&aring;r vi skal lave en sammenligning mellem produkter og deres funktionalitet p&aring; de to platforme, skal vi netop belyse deres evner til at l&aelig;se en konkret opgave, og med hvilken effektivitet problemet bliver l&aelig;st. Den strategiske beslutning om et skifte af it-platform skal s&aring;ledes ske efter, man har l&aelig;st denne bog, og det skal da ikke v&aelig;re skjult for l&aelig;serne, at jeg h&aring;ber, denne bog kan bidrage til, at det naturlige valg falder ud til gunst for Linux.</PARA>
<PARA>Hvis jeg kort skal forklare de to figurer, kan det sammenfattes p&aring; f&oslash;lgende m&aring;de</PARA>
<ITEMIZEDLIST MARK="bullet"><LISTITEM><PARA>I vores analyse indg&aring;r fire variable: Brugervenlighed, drift, sikkerhed og &oslash;konomi.</PARA></LISTITEM>
<LISTITEM><PARA>De fire variable p&aring;virker hinanden gensidigt - F.eks. betyder d&aring;rlig sikkerhed, at driften bliver besv&aelig;rlig - mere overv&aring;gning, mere overv&aring;gning betyder flere arbejdstimer, hvilket betyder st&oslash;rre &oslash;konomiske byder p&aring; virksomheden etc, og idealet er, at der eksisterer en ligev&aelig;gtstilstand imellem dem - her betyder ligev&aelig;gt, at man skal ligge lige stor v&aelig;gt p&aring; de forskellige variables betydning.</PARA></LISTITEM>
<LISTITEM><PARA>Analyseniveauet for vores variable er p&aring; det operationelle og taktiske neveau, hvilket betyder, at det er de to platformes evner til at l&oslash;se problemer p&aring; den mest effektive m&aring;de, vi skal vurdere, og ikke s&aring; meget skal se p&aring; de overordnede aspekter, der har betydning for virksomheden udaftil.</PARA></LISTITEM></ITEMIZEDLIST>
<PARA>Inden vi g&aring;r videre, skal vi have defineret den &oslash;konomiske analysevariabel, da man inden for erhvers&oslash;konomi opererer man med forskellige parametre. Til vores form&aring;l skal vi se p&aring; totalomkostningen (TCO)<FOOTNOTE><PARA>I international literatur bruger man begrebet total cost of ownership (TCO), som jeg selv synes d&aelig;kker begrebet bedre, men jeg kan ikke finde en passende dansk overs&aelig;ttelse, s&aring; i resten af bogen vil begrebet TCO blive brugt</PARA></FOOTNOTE> ved en overgang til en it-strategi baseret p&aring; linuxplatformen. Det betyder, at alle direkte og indirekte omkostninger, s&aring; vidt det er muligt, skal medregnes.
</PARA></SECT1>
<SECT1 ID="WHY"><TITLE>Hvorfor er denne bog relevant for dig</TITLE>
<PARA>Afsnittet vil have til form&aring;l at opstille et skema, som kan anvendes, n&aring;r man skal lave en sammenligning mellem produkter p&aring; de to platforme. Udover nogen generelle observationer omkring det at skifte it-platform, vil jeg diskutere en r&aelig;kke forhold af teknisk karakter, som b&oslash;r indg&aring; i enhver overvejelse, n&aring;r man skal foretage migration fra en platform til en anden. Det er resultatet af denne diskussion, som g&oslash;r os i stand til, at opstille en r&aelig;kke punkter eller huskeregler i den sluttelige sammenligningsskema.</PARA>
<PARA>De fleste systemadministratorer i dag har allerede h&oslash;rt om Linux og Open Source tankegangen, og de har formentligt ogs&aring; gjort deres overvejelser over, hvorvidt et skift til Linux var en mulighed. Det der har holdt dem tilbage, har v&aelig;ret manglende viden og support p&aring; omr&aring;det - det f&oslash;rste punkt skal denne bog hj&aelig;lpe til med at udligne, og det andet punkt burde give sig selv, da s&aring; store foretagender som IBM, Compaq, Dell, Sun og Oracle aktivt st&oslash;tter Linux og Open Source samfundet - vi kan vel heller ikke helt udelade Apple, da det nye Mac OS X bygger p&aring; en Linuxkerne. Et andet vigtigt aspekt i denne sammenh&aelig;ng er ogs&aring; ledelsernes manglende indsigt i, hvad Linux er for noget, som til dels kan f&oslash;res tilbage p&aring; linuxmilj&oslash;et selv, da udenforst&aring;ende let kan f&aring; den opfattelse, at Linux og Open Source milj&oslash;et er befolket med idelogiske it n&oslash;rder, for hvem erhvervs&oslash;konomiske betragter ligger fjernt. Denne opfattelse har ogs&aring; haft sin berettigelse tidligere, og der findes standig denne type mennesker i milj&oslash;et, men det erhvervsm&aelig;ssige aspekt er ved at finde indpas - det skal denne bog blandt andet ogs&aring; bidrage til.</PARA>
<PARA>N&aring;r man st&aring;r overfor s&aring; stor en beslutning, som migrering til en ny it-platform er, rejser der sig naturligt en r&aelig;kke vigtige sp&oslash;rgsm&aring;l, som denne bog skal v&aelig;re med til at afdramatisere. En vigtig pointe her er, at disse sp&oslash;rgsm&aring;l for s&aring; vidt ogs&aring; g&aelig;lder, hvis man skal opgradere til Windows 2000/XP eller Windows XP, og med de sidste udmeldinger fra Microsoft bliver dette jo alts&aring; snart en realitet, da Microsoft officielt har stoppet support p&aring; Windows 95 og 98, og n&aring;r Windows XP bliver officielt udsendt, vil dette ogs&aring; v&aelig;re en realitet for Windows NT. En tankev&aelig;kkende artikel der adresserer problemstilling for denne bog, findes her<ULINK URL="http://www.anandtech.com/printarticle.html?i=1527">www.anandtech.com</ULINK></PARA>
<PARA>De vigtige sp&oslash;rgsm&aring;l kan afgr&aelig;nses til f&oslash;lgende:</PARA>
<ITEMIZEDLIST MARK="bullet"><LISTITEM><PARA>Hvad er omkostningerne.</PARA></LISTITEM>
<LISTITEM><PARA>Hvor vanskelig en opgave er det.</PARA></LISTITEM>
<LISTITEM><PARA>Hvor tidskr&aelig;vende er opgaven.</PARA></LISTITEM></ITEMIZEDLIST>
<PARA>De ovenn&aelig;vnte sp&oslash;rgsm&aring;l vil alle blive besvaret i dette afsnit, og det generelle svar kan allerede gives nu: Det kr&aelig;ver en omhyggelig planl&aelig;gning</PARA>
<PARA>Fremgangsm&aring;den, denne bog anbefaler, er, at det skal ske gradvist, s&aring; det har mindst mulig indflydelse p&aring; organisationens effektivitet. Derfor er det mit forslag, at skiftet foreg&aring;r i tre tempi: F&oslash;rste skiftet ud p&aring; serversiden, dern&aelig;st skiftes arbejdsstationerne hos de medarbejdere, hvor skiftet ikke betyder en umiddelbar effektivitetsnedgang, eller dem der ikke anvender programmer, hvortil der ikke findes substituerende produkter til Linux. Til sidst gennemf&oslash;res skiftet hos de medarbejdere, hvor arbejdet er t&aelig;t knyttet til windowsplatformen. Eventuelt kan en l&aelig;sning her blive, at man skal bibeholde et antal windowsmaskiner over en l&aelig;ngere periode, indtil brugbare l&oslash;sninger findes p&aring; linuxplatformen</PARA>
<PARA>Nu stiller du m&aring;ske, som leder i en virksomhed, sp&oslash;rgsm&aring;let, hvorfor s&aring; skifte? Denne bog vil vise, at der kan hentes store besparelser p&aring; it-budgettet, som er et resultat af, at man undg&aring;r, at skulle opgradere sin hardware, og samtidigt bliver man fritaget for, at skulle betale store &aring;rlige licensregninger til Microsoft. Tilsvarende vil it-administratorene stille sp&oslash;rgsm&aring;let, kan vi magtet at skifte? Denne bog vil vise, at det kan man godt, da de fleste har gennemf&oslash;rt lignende skift f&oslash;r. Skiftet i sin tid fra Netware/Unix til Windows NT var ikke mindre besv&aelig;rligt eller anderledes, end et skiftet fra Windows NT til Linux vil v&aelig;re - et tilsvarende skift fra Windows NT til Windows 2000/XP eller Windows XP er bestemt ikke lettere. Husk blot p&aring; alle de service packs du har installeret i gennem tiden p&aring; Windows NT, som i mange tilf&aelig;lde var en stor systemopgradering, der, selv med n&oslash;je planl&aelig;gning og test, tit bet&oslash;d uforudsete vanskeligheder. Du vil under alle omst&oslash;ndigheder skulle foretage en snarlig opgradering, hvis du benytter Windows NT i dag, da support og videreudvikling snart stopper fra Microsofts side, s&aring; hvorfor ikke hellere g&oslash;re det frivilligt, og i det tempo der passer til dit firma, end skulle v&aelig;re tvunget til en hastig opgradering til en helt ukendt verden! Linux er i denne sammenh&aelig;ng en pr&oslash;vet og sikker l&oslash;sning, og skiftet til Linux er en opgave af samme omfang, som det tilsvarende skifte til Windows 2000/XP vil v&aelig;re. Et skifte, om der er til Linux eller Windows 2000/XP, kr&aelig;ver uddannelse af medarbejderne i it-administrationen, test af den valgte l&oslash;sning, overf&oslash;rsel af nuv&aelig;rende data og brugerkonti, test af brugerrettigheder og den eksterne sikkerhed. P&aring; nogle omr&aring;der, vil det sikkert vise sig, at skiftet til Linux er simplere, da de programmer der findes i dag, ikke skal skrives om, og samtidig har du en garanti for, at du ikke skal g&oslash;re det hele en gang til i fremtiden!</PARA>
<PARA>Det mest attraktive ved at skifte til Linux er den frie og &aring;bne software, som betyder, at penge investeret i udvikling i dag ikke g&aring;r til spilde, og i sig selv er en fordelagtig investering - Hvad gavn har du af dine investeringer og viden om Windows NT, n&aring;r du opgradere til Windows 2000/XP? Hvem har besluttet, at disse investeringer er for&aelig;ldet, og skal afskrives? Investeringer i Linux er en investering langt ud i fremtiden, det er kun dig selv, der bestemmer hvorn&aring;r, de skal afskrives</PARA></SECT1>
<SECT1 ID="SERVER-SIDE"><TITLE>Serversiden</TITLE>
<PARA>Opdelingen i en serverside og en klientside er ikke valgt arbitr&aelig;r, men har sin begrundelse i, at den vil v&aelig;re to helt forskellige opgaver. Et skifte p&aring; serversiden beh&oslash;ver ikke at f&aring; nogen indflydelse p&aring; organisationen, og kan gennemf&oslash;res transparent overfor brugerne, hvilket betyder, at det kan foreg&aring; i et passende tempo, og ikke kr&aelig;ver hastige og uovervejede beslutninger. For at g&oslash;re opgaven overskuelig kommer her et par r&aring;d</PARA>
<ITEMIZEDLIST><LISTITEM><PARA>G&oslash;r ikke det hele p&aring; en gang. Start p&aring; serversiden og vent med brugersiden til serverudskiftningen er gennemf&oslash;rt tilfredsstillende</PARA></LISTITEM>
<LISTITEM><PARA>Undg&aring; programudvikling</PARA></LISTITEM>
<LISTITEM><PARA>L&aelig;r Linux at kende; det kan mere end Windows, s&aring; det kan anbefales, at der bruges tid p&aring; at l&aelig;re det at kende, da det n&aelig;sten altid viser sig, at ting der f&oslash;r var vanskelige under Windows, kan g&oslash;res enklere og nemmere under Linux. Frig&oslash;r dig fra Windows' begr&aelig;nsninger, og t&aelig;nk og arbejd Linux</PARA></LISTITEM>
<LISTITEM><PARA>Brug flere, mere &aring;bne protokoller. Jo flere protokoller p&aring; netv&aelig;rket, jo st&oslash;rre vil opgaven blive at administrere det</PARA></LISTITEM></ITEMIZEDLIST>
<SECT2 ID="HOWTO-SERVER"><TITLE>Platformsskift - hvordan</TITLE>
<PARA>I dette afsnit vil metoden for skiftet blive gennemg&aring;et n&aelig;rmere, og den indeholder fire trin. De f&oslash;rste tre giver dig et overblik over dine data, og hvordan adgangen til dem er i dag, mens det sidste trin indeholder udarbejdelsen af et diagram, der vil give dig et overblik over, hvordan server og klientl&oslash;sningen skal udarbejdes. 
</PARA>
<PARA>De fire trin er f&oslash;lgende:</PARA>
<ITEMIZEDLIST MARK="number"><LISTITEM><PARA>Lav en liste over dine data, og hvor de befinder sig. Listen skal ogs&aring; vise, hvem der har ansvaret for dataene - systemadministrationen eller brugerne</PARA></LISTITEM>
<LISTITEM><PARA>Lav en liste over de programmer, der benyttes i dag</PARA></LISTITEM>
<LISTITEM><PARA>Lav en liste over de anvendte protokoller, og hvordan kommunikationen foreg&aring;r til data i dag</PARA></LISTITEM>
<LISTITEM><PARA>Udarbejd diagrammet</PARA></LISTITEM></ITEMIZEDLIST>
<PARA>Som man kan se, er trinene protokol og programstyret, hvilket giver mulighed for at f&aring; et overblik over de forskellige l&oslash;sningsmodeller, der kan v&aelig;lges, under hensyntagen til de bindinger forskellige programmer og protokoller medf&oslash;rer. N&aring;r man kender alle l&aelig;sningsmodeller, har man mulighed for at v&aelig;lge den l&oslash;sning, der er mest optimal for virksomheden.</PARA>
<SECT3 ID="DATALISTE"><TITLE>Listen over data</TITLE>
<PARA>Verden af i dag betyder, at alle mennesker har enorme datalagre liggende p&aring; deres computere. Nogen ligger placeret de officielle steder - i hjemmekataloget p&aring; serverne, mens andre er placeret uofficielt - lokalt p&aring; arbejdsstationerne, men ligegyldigt hvor de ligger placeret, er de v&aelig;sentlige for medarbejdernes arbejdsindsats, og derfor skal vi have styr p&aring;, hvor de befinder sig. Typiske eksempler p&aring; disse vigtige data er:</PARA>
<ITEMIZEDLIST MARK="bullet"><LISTITEM><PARA>Email og adresseb&oslash;ger. Hvordan er data gemt? Hvilke mailservere og protokoller anvendes? Hvilken form for autorisation bruges?</PARA></LISTITEM>
<LISTITEM><PARA>Kalendere og tidsplanl&aelig;gningsprogrammer. Mailsystemer leveres ofte sammen med gruppebaserede tidsplanl&aelig;gningsprogrammer (Microsoft Exchange, Lotus Domino etc.), og kr&aelig;ver ofte s&aelig;rlige forholdsregler, da de sj&aelig;ldent benytter &aring;bne standarder.</PARA></LISTITEM>
<LISTITEM><PARA>Filressourcer. Brugere har ofte store m&aelig;ngder af f&aelig;lles officedokumenter liggende, som er vitale.</PARA></LISTITEM>
<LISTITEM><PARA>Databaser. P&aring; serversiden er det produkter som Oracle eller Microsoft SQL server, mens det p&aring; brugersiden typisk er Microsoft Access. M&aring;let er, at bruger ikke m&aelig;rker nogen &aelig;ndringer i deres daglige brug af disse. Betyder ikke produkterne er ens, men kun at brugerinterfaced ikke &aelig;ndres</PARA></LISTITEM>
<LISTITEM><PARA>Webservere. Brugere som vedligeholder dem, skal ikke m&aelig;rke nogen forskel; de skal stadigv&aelig;k kunne anvende de programmer, de vedligeholder dem med i dag. Data p&aring; websider kan ogs&aring; v&aelig;re hentet udefra, og derfor skal man have styr p&aring;, hvordan data lagres og deres format samt hvilke bindinger der er - ActiveX, ASP etc.</PARA></LISTITEM></ITEMIZEDLIST>
<PARA>Der findes ogs&aring; vigtige data p&aring; serverne, som bliver administreret af systemadministrationen. Til disse henh&oslash;re blandt andet:</PARA>
<ITEMIZEDLIST MARK="bullet"><LISTITEM><PARA>Brugerdatabaser. Indeholder en detaljeret beskrivelse af alle brugere p&aring; virksomhedens net, og hvilke rettigheder hver enkelt bruger har</PARA></LISTITEM>
<LISTITEM><PARA>Grupper og rettigheder. Hvilke grupper findes p&aring; virksomhedens net? F.eks. er salgsafdelingen en typisk gruppe, der skal kunne tilg&aring; kundedatabasen</PARA>
<PARA>Backup arkiver. I windowsverdenen er det typisk tredjepartsprogrammer, der h&aring;ndtere backup, s&aring; vi skal finde ud af, om det findes p&aring; til Linux</PARA></LISTITEM>
<LISTITEM><PARA>Logfiler. Vigtige hvis noget g&aring;r galt, eller som bevis i en retsag vedr&aelig;rende hacking mv.</PARA></LISTITEM></ITEMIZEDLIST></SECT3>
<SECT3 ID="BRUGERAPPLIKATIONER"><TITLE>Nuv&aelig;rende brugerprogrammer</TITLE>
<PARA>Selvom der findes et utal af programmer til Windows, kommer de fleste programmer fra h&oslash;jest 10 forskellige udbydere, s&aring; hvis man kan lave en samlet aftale med nogen f&aring; af dem, er de fleste problemer p&aring; klientsiden l&oslash;st</PARA>
<PARA>Manglen p&aring; erstatninger for nogle programmer p&aring; klientsiden knytter sig hovedsageligt til Microsoftprodukter, men da Linux er i stand til at servicere disse programmer, og da vi benytter en flertrinsraket, giver dette sj&aelig;lden nogen problemer. De f&aelig;reste begynder alligevel ikke p&aring; klientsiden f&oslash;rst, da medarbejderne f&oslash;rst skal have den n&oslash;dvendig uddannelse</PARA>
<PARA>Den nemmeste m&aring;de at starte planl&aelig;gningen af systemskiftet p&aring; klientsiden er at udarbejde en tabel, der adresserer firmaets specifikke behov. Denne kunne foreksempel se ud p&aring; f&oslash;lgende m&aring;de:</PARA>
<TABLE ID="WINDOWSPROGRAMMER"><TITLE>Microsoft Windows programmer</TITLE>
<TGROUP COLS="5" ALIGN="CHAR"><THEAD><ROW><ENTRY>Program</ENTRY>
<ENTRY>Anvendelse</ENTRY>
<ENTRY>Kan benytte linuxserver</ENTRY>
<ENTRY>Substitueres med</ENTRY>
<ENTRY>Linuxversion</ENTRY></ROW></THEAD>
<TBODY><ROW><ENTRY>MS Office</ENTRY>
<ENTRY>Skrive og redigere dokumenter, regneark, pr&aelig;sentationer mv.</ENTRY>
<ENTRY>Ja, via Samba</ENTRY>
<ENTRY>F&aring;. WordPerfect, StarOffice og OpenOffice</ENTRY>
<ENTRY>Ja, WordPerfect, StarOffice og OpenOffice</ENTRY></ROW>
<ROW><ENTRY>Osv.</ENTRY>
<ENTRY>Osv.</ENTRY>
<ENTRY>Osv.</ENTRY>
<ENTRY>Osv.</ENTRY>
<ENTRY>Osv.</ENTRY></ROW></TBODY></TGROUP></TABLE></SECT3>
<SECT3 ID="PROTOKOLLER"><TITLE>Protokoller og kommunikation i dag</TITLE>
<PARA>Det f&oslash;lgende afsnit vedr&oslash;rer protokoller, og hvordan kommunikationen foreg&aring;r. L&aelig;sten skal indeholde de protokoller, som firmaets microsoftprogrammer benytter. Hvis man ikke er sikker, findes der forskellige programmer man kan bruge til at finde ud af det, forlad dig ikke udelukkende p&aring; dokumentationen. Disse programmer kaldes netv&aelig;rkssniffere.</PARA>
<PARA>Det interessante her er, at n&aelig;sten alle ikke standardteknologier fra Microsoft enten er baseret p&aring; p&aring; allerede eksisterende teknologier, eller er dokumenteret p&aring; et lavere niveau. Politikken her er helt klar: Hold dig til &aring;bne standarder<FOOTNOTE><PARA>Hvis en protokol er dokumenteret, betyder det i denne sammenh&aelig;ng, at det er en &aring;ben standard</PARA></FOOTNOTE>, da det giver frihed fra producenterne</PARA>
<PARA>En anden pudsig ting er, at de fleste produkter fra Microsoft udem&aelig;rket kan kommunikere over standardteknologier, men er opsat til at benytte Microsofts egne ikke standardiserede teknologier, s&aring; i de fleste tilf&aelig;lde er det kun et sp&oslash;rgsm&aring;l om at omkonfigurere programmerne</PARA>
<PARA>Et eksempel p&aring; en tabel kommer her:</PARA>
<TABLE ID="WINDOWSPROTOKOLLER"><TITLE>Protokoller foretrukket af Microsofts produkter</TITLE>
<TGROUP COLS="3" ALIGN="CHAR"><THEAD><ROW><ENTRY>Anvendelse</ENTRY>
<ENTRY>Foretrukken protokol/kommunikation</ENTRY>
<ENTRY>Dokumenteret</ENTRY></ROW></THEAD>
<TBODY><ROW><ENTRY>MS Outlook til MS Exchange Server</ENTRY>
<ENTRY>MAPI over DCE/RPC til email</ENTRY>
<ENTRY>Krypteret p&aring; en udokumenteret m&aring;de</ENTRY></ROW>
<ROW><ENTRY>Osv.</ENTRY>
<ENTRY>Osv.</ENTRY>
<ENTRY>Osv.</ENTRY></ROW></TBODY></TGROUP></TABLE>
<TABLE ID="PROTOKOLERSTATNINGER"><TITLE>Protokolerstatninger og implementationer</TITLE>
<TGROUP COLS="4" ALIGN="CHAR"><THEAD><ROW><ENTRY>Protokol</ENTRY>
<ENTRY>Fri Implementation</ENTRY>
<ENTRY>&Aring;ben alternativ</ENTRY>
<ENTRY>Kommentarer</ENTRY></ROW></THEAD>
<TBODY><ROW><ENTRY>MAPI over DCE/RPC</ENTRY>
<ENTRY>Nej</ENTRY>
<ENTRY>IMAP og tilsvarende standarder</ENTRY>
<ENTRY>Cyrus mail suite kan erstatte MS EXchange</ENTRY></ROW>
<ROW><ENTRY>MAPI over DCE/RPC til kalender</ENTRY>
<ENTRY>Nej</ENTRY>
<ENTRY>ACAP, ICAP, vCARD og tilsvarende standarder</ENTRY>
<ENTRY>Hvis Outlook mail og kalender er et must, findes der HP Openmail til Linux</ENTRY></ROW></TBODY></TGROUP></TABLE>
<PARA>Her kan du l&aelig;se mere om <ULINK URL="http://www.openmail.com">OpenMail</ULINK><FOOTNOTE><PARA>Rygter siger, at HP stopper support, videreudvikling og salg fra 1. januar 2002</PARA></FOOTNOTE></PARA></SECT3>
<SECT3><TITLE>Protokoldiagrammet</TITLE>
<PARA>P&aring; baggrund af de forrige tabeller skulle du v&aelig;re i stand til at lave nedenst&aring;ende liste. Se <XREF LINKEND="PROTOKOLDIAGRAM-FIG"></PARA>
<ITEMIZEDLIST MARK="bullet"><LISTITEM><PARA>Kombinationen af protokoller/programmer der kan benyttes for at kommunikere med linuxserveren - ogs&aring; kombinationer der ikke benyttes p&aring; nuv&aelig;rende tidspunkt, skal med.</PARA></LISTITEM>
<LISTITEM><PARA>De protokoller som &aring;ben server software kan benytte til at servicere eksisterende data.</PARA></LISTITEM>
<LISTITEM><PARA>De protokoller &aring;bne klientprogrammer kan benytte til at kommunikere med eksisterende data</PARA></LISTITEM></ITEMIZEDLIST>
<FIGURE FLOAT="1" ID="PROTOKOLDIAGRAM-FIG"><TITLE>Eksempel p&aring; et protokoldiagram</TITLE>
<GRAPHIC FILEREF="protokoldiagram.&magic" SCALE="45"></GRAPHIC></FIGURE>
<PARA>Vi har nu f&aelig;rdigbehandlet serversiden, og med denne gennemgang skulle du v&aelig;re rustet til at p&aring;begynde din egen migrationsplan, men til slut mangler jeg lige at pointere, at de enkelte programmer og deres forskellige protokollor vil blive behandlet i deres respektive afsnit.</PARA></SECT3></SECT2></SECT1>
<SECT1 ID="CLIENT-SIDE"><TITLE>Klientsiden</TITLE>
<PARA>I forrige afsnit behandlede jeg serversiden ved et platformsskift, mens emnet for dette kapitel vil v&aelig;re klientsiden. Som n&aelig;vnt i kapitel 1 findes der flere forskellige alternative distributioner til Linux, men hvis jeg skal komme med et forslag til valg af distribution, m&aring; valget falde p&aring; enten Redhat eller Suse, da de, efter min mening, har den bedste l&oslash;sning, hvis anvendelsen er erhvervsorienteret. De har begge glimrende standardvalgte installationsprocedurer, og hele processen gennemf&oslash;res gennem et grafisk interface. Om valget falder p&aring; den ene eller anden distribution, vil jeg lade v&aelig;re helt op til dig selv at afg&oslash;re, blot kan n&aelig;vnes, at Redhat er en amerikansk distribution, mens Suse bliver udviklet i Tyskland, men for begge distributioners vedkommende g&aelig;lder, at der findes en s&aelig;rlig version til erhvervsbrug, og begge distributioner har ogs&aring; et omfattende supportprogram til erhvervslivet. Find mere her:</PARA>
<ITEMIZEDLIST><LISTITEM><PARA><ULINK URL="http://www.suse.dk">www.suse.dk</ULINK></PARA></LISTITEM>
<LISTITEM><PARA><ULINK URL="http://www.redhat.com">www.redhat.com</ULINK></PARA></LISTITEM></ITEMIZEDLIST>
<PARA>Et ufravigelig regel m&aring; dog v&aelig;re, at du skal ikke v&aelig;lge en distribution, du ikke kan f&aring; kvalificeret support til</PARA>
<PARA>En anden fremgangsm&aring;de kunne v&aelig;re, at v&aelig;lge en leverand&oslash;r der tilbyder pr&aelig;konfigurerede maskiner og support til linux. Af disse findes i dag f&oslash;lgende producenter:</PARA>
<ITEMIZEDLIST><LISTITEM><PARA><ULINK URL="http://www.compaq.dk">www.compaq.dk</ULINK></PARA></LISTITEM>
<LISTITEM><PARA><ULINK URL="http://www.dell.dk">www.dell.dk</ULINK></PARA></LISTITEM>
<LISTITEM><PARA><ULINK URL="http://www.hp.dk">www.hp.dk</ULINK></PARA></LISTITEM>
<LISTITEM><PARA><ULINK URL="http://www.ibm.dk">www.ibm.dk</ULINK></PARA></LISTITEM>
<LISTITEM><PARA><ULINK URL="http://www.fujitsu-siemens.dk">www.fujitsu-siemens.dk</ULINK></PARA></LISTITEM></ITEMIZEDLIST>
<SECT2 ID="HOWTO-CLIENT"><TITLE>Desktopskift - hvordan</TITLE>
<PARA>Inden man begynder at udskifte desktoppen, er det n&oslash;dvendigt, at man danner sig et overblik over, hvilke programmer man anvender under Windows i dag, og om der eventuelt findes alternativer til Linux i dag. Alternativer kan i denne sammenh&aelig;ng v&aelig;re identiske programmer skrevet til begge platforme - f.eks. findes Netscape b&aring;de til Windows og Linux, eller om der skulle findes substituerende programmer - f.eks. kan Adobes Acrobat Reader erstattes med StarOffice 6.0 (giver mulighed for at gemme i pdf-format).
</PARA>
<PARA>F&oslash;rste trin er at opstille et applikationsskema, der giver et overblik over hvilken type programmer firmaet benytter i dag, og hvad den tilsvarende applikation hedder i Windows. Jeg vil her give et eksempel p&aring; standardskemaet, som naturligvis skal tilpasses den konkrete situation. Der vil uden tvivl v&aelig;re en del programmer, der ikke er standard, men disse programmer foresl&aring;r jeg, at man opstiller i et separat skema, da disse programmer uden tvivl b&oslash;r have en n&aelig;rmere analyse, og samtidig beh&oslash;ver de m&aring;ske ikke at v&aelig;re standard p&aring; alle arbejdsstationer.</PARA>
<TABLE ID="APPLIKATIONSSKEMA"><TITLE>Applikationsskema</TITLE>
<TGROUP COLS="2" ALIGN="CHAR"><THEAD><ROW><ENTRY>Type af applikation</ENTRY>
<ENTRY>Windowsapplikation</ENTRY></ROW></THEAD>
<TBODY><ROW><ENTRY>Office pakke</ENTRY>
<ENTRY>Office 97/2000</ENTRY></ROW>
<ROW><ENTRY>Internetbrowser</ENTRY>
<ENTRY>Internet Explorer</ENTRY></ROW>
<ROW><ENTRY>Sikkerhed</ENTRY>
<ENTRY>Zone Alarm og et antivirusprogram (Norton, McAfee etc.)</ENTRY></ROW>
<ROW><ENTRY>Publicering</ENTRY>
<ENTRY>Adobe Acrobat og et cd-br&aelig;nderprogram (Easy CD Creator, Nero Burning Rom etc.)</ENTRY></ROW>
<ROW><ENTRY>Grafik</ENTRY>
<ENTRY>Billedbehandlingsprogram (Adobe Photoshop, Microsoft Picture Publisher)</ENTRY></ROW>
<ROW><ENTRY>Utilities</ENTRY>
<ENTRY>pakkeprogram - Winzip, email - Outlook/Outlook Express, audiovisuel funktionalitet - Realplayer/Windows Media Player</ENTRY></ROW></TBODY></TGROUP></TABLE>
<PARA>Det n&aelig;ste valg man skal tr&aelig;ffe vedr&oslash;rer den grafiske brugergr&aelig;nseflade. I Windows giver det sig selv, mens der til Linux findes utallige. Her er det vist p&aring; plads hurtigt at forklare forskellen mellem de to alternativer, og for at kunne det, skal vi g&aring; nogen &aring;r tilbage, faktisk helt tilbage til den tid hvor Dos stadig var en del af computeren, og hvor man efter opstart af Dos skulle starte Windows op - kunne dog automatiseres. I dag er det s&aring;dan, at man ikke har dette valg mere, men springer opstarten af Dos op, og g&aring;r direkte til Windows. Under Linux er det som i gamle dage i windowsverdenen, men forskellen er blot den, at man i linuxverdenen kan v&aelig;lge mellem utallige grafiske brugergr&aelig;nseflader - nogen mere veludviklede end andre. I dag er situationen den, at n&aring;r man snakker grafisk brugergr&aelig;nseflade, findes der to store spillere p&aring; markedet med hver deres bud p&aring; en grafisk tilgang til Linux. Groft sagt kan de faktisk opdeles i en udgave, der har Apples grafiske gr&aelig;nseflade som reference - Gnome, og en udgave der har windows grafiske gr&aelig;nseflade som reference - KDE. Da Windows er den mest benyttede grafiske gr&aelig;nseflade i Danmark, vil jeg anbefale, at man v&aelig;lger KDE som grafisk brugergr&aelig;nseflade.</PARA>
<PARA>Inden vi afslutter dette kapitel, skal vi lige omkring Windows' og Linuxs krav til den anvendte hardware. De f&oslash;lgende observationer er gjort p&aring; en Pentium Celeron 400 MHz desktop computer med Linux (Redhat 7.1) og Windows 2000 installeret. Som man kan se i tabellen, er der en signifikant forskel p&aring; ramforbrug under henholdsvis Windows og Linux.</PARA>
<TABLE ID="RAMFORBRUG" PGWIDE="1"><TITLE>Inital ramforbrug under Linux og Windows 2000</TITLE>
<TGROUP COLS="5"><COLSPEC COLNAME="C1"><COLSPEC COLNAME="C2"><COLSPEC COLNAME="C3"><COLSPEC COLNAME="C4"><COLSPEC COLNAME="C5"><SPANSPEC NAMEEND="C3" ALIGN="CHAR" SPANNAME="INITIAL" NAMEST="C2"><SPANSPEC NAMEEND="C5" ALIGN="CHAR" SPANNAME="WORK" NAMEST="C4">
<THEAD><ROW><ENTRY></ENTRY>
<ENTRY SPANNAME="INITIAL">Ramforbrug efter opstart</ENTRY>
<ENTRY SPANNAME="WORK">Ramforbrug efter start af StarOffice 6.0 eller Windows 2000. Opstart af respektive kontorpakker indeholdt tekstbehandling, regneark og Evolution/Outlook</ENTRY></ROW></THEAD>
<TBODY><ROW><ENTRY></ENTRY>
<ENTRY ALIGN="CENTER">Initial ramforbrug</ENTRY>
<ENTRY ALIGN="CENTER">Brug af swap</ENTRY>
<ENTRY ALIGN="CENTER">Ramforbrug</ENTRY>
<ENTRY ALIGN="CENTER">Brug af swap</ENTRY></ROW>
<ROW><ENTRY>Redhat Linux 7.1</ENTRY>
<ENTRY ALIGN="CENTER">45 MB</ENTRY>
<ENTRY ALIGN="CENTER">0 MB</ENTRY>
<ENTRY ALIGN="CENTER">75 MB</ENTRY>
<ENTRY ALIGN="CENTER">0 MB</ENTRY></ROW>
<ROW><ENTRY>Windows 2000</ENTRY>
<ENTRY ALIGN="CENTER">140 MB</ENTRY>
<ENTRY ALIGN="CENTER">35 MB</ENTRY>
<ENTRY ALIGN="CENTER">170 MB</ENTRY>
<ENTRY ALIGN="CENTER">35 MB</ENTRY></ROW></TBODY></TGROUP></TABLE>
<PARA>Som det fremg&aring;r af ovenst&aring;ende observationer, stiller Linux v&aelig;sentlige mindre krav til v&aelig;rtsmaskinen end Windows. Linuxs er mere effektiv i dens udnyttelse af ram, og derfor kan man afvikle flere programmer udover StarOffice med 128 MB ram, uden at skulle g&oslash;re brug af swap. Konklusion: <EMPHASIS>Linux kan afvikles med mindre end halvdelen af den ram, der kr&aelig;ves for at afvikle Windows 2000, hvilket betyder, at man ikke vil skulle opgradere sin hardware, som en tilsvarende opgradering til Windows 2000 vil kr&aelig;ve.</EMPHASIS></PARA>
<PARA>Hardware kompatibiliteten under Linux er dog ikke lige s&aring; stor, som det er tilf&aelig;ldet under Windows, men er computeren mindre end tre &aring;r gammel, skulle det n&aelig;ppe give nogen problemer. Se disse link for en detaljeret gennemgang</PARA>
<ITEMIZEDLIST><LISTITEM><PARA><ULINK URL="http://hardware.redhat.com/">http://hardware.redhat.com</ULINK></PARA></LISTITEM>
<LISTITEM><PARA><ULINK URL="http://hardwaredb.suse.de/">http://hardwaredb.suse.de/</ULINK></PARA></LISTITEM></ITEMIZEDLIST></SECT2></SECT1>
<SECT1 ID="ECONOMY"><TITLE>Hvordan ser &oslash;konomien ud</TITLE>
<PARA>Da &oslash;konomi er en specifik ting, har jeg gjort mig f&oslash;lgende foruds&aelig;tninger for mine beregninger:</PARA>
<ITEMIZEDLIST><LISTITEM><PARA>Arbejdsstationer</PARA></LISTITEM>
<LISTITEM><ITEMIZEDLIST><LISTITEM><PARA>Pentium II/Celeron eller AMD K6-2</PARA></LISTITEM>
<LISTITEM><PARA>128 MB ram</PARA></LISTITEM>
<LISTITEM><PARA>Windows NT Workstation</PARA></LISTITEM>
<LISTITEM><PARA>Microsoft Office 97</PARA></LISTITEM></ITEMIZEDLIST></LISTITEM>
<LISTITEM><PARA>Server</PARA></LISTITEM>
<LISTITEM><ITEMIZEDLIST><LISTITEM><PARA>Windows NT Server 5 bruger</PARA></LISTITEM></ITEMIZEDLIST></LISTITEM></ITEMIZEDLIST>
<PARA>Ovenst&aring;ende er en minimuminstallation, men den kan let udvides til dit firmas specifikationer. For arbejdsstationernes vedkommende skal du blot gange op med antallet, mens det straks er lidt sv&aelig;re for serverens vedkommende, her m&aring; du f&aring; opgraderingsudgiften ved at bede om et tilbud fra MicroSoft Danmark.</PARA>
<PARA>Med ovenst&aring;ende foruds&aelig;tninger vil &oslash;konomien se ud p&aring; f&oslash;lgende m&aring;de<FOOTNOTE><PARA>Eksemplet er baseret p&aring; linuxdistributionen Redhat Linux 7.1</PARA></FOOTNOTE>:</PARA>
<TABLE><TITLE>Windows 2000 opgradering</TITLE>
<TGROUP COLS="2" ALIGN="CHAR"><THEAD><ROW><ENTRY></ENTRY>
<ENTRY>Pris kr.</ENTRY></ROW></THEAD>
<TFOOT><ROW><ENTRY>Total kr.</ENTRY>
<ENTRY ALIGN="RIGHT">11.325</ENTRY></ROW></TFOOT>
<TBODY><ROW><ENTRY>Arbejdsstation</ENTRY>
<ENTRY></ENTRY></ROW>
<ROW><ENTRY>Ramopgradering</ENTRY>
<ENTRY ALIGN="RIGHT">150</ENTRY></ROW>
<ROW><ENTRY>Windows 2000 opgradering</ENTRY>
<ENTRY ALIGN="RIGHT">1.695</ENTRY></ROW>
<ROW><ENTRY>Office XP professionel opgradering</ENTRY>
<ENTRY ALIGN="RIGHT">3.480</ENTRY></ROW>
<ROW><ENTRY>Server</ENTRY>
<ENTRY ALIGN="RIGHT"></ENTRY></ROW>
<ROW><ENTRY>Windows 2000 server opgradering</ENTRY>
<ENTRY ALIGN="RIGHT">6.000</ENTRY></ROW></TBODY></TGROUP></TABLE><TABLE><TITLE>Linux Redhat 7.1 alternativ</TITLE>
<TGROUP COLS="2" ALIGN="CHAR"><THEAD><ROW><ENTRY></ENTRY>
<ENTRY>Pris kr.</ENTRY></ROW></THEAD>
<TFOOT><ROW><ENTRY>Total kr.</ENTRY>
<ENTRY ALIGN="RIGHT">2.288</ENTRY></ROW></TFOOT>
<TBODY><ROW><ENTRY>Arbejdsstation</ENTRY>
<ENTRY></ENTRY></ROW>
<ROW><ENTRY>Ramopgradering</ENTRY>
<ENTRY ALIGN="RIGHT">-</ENTRY></ROW>
<ROW><ENTRY>Redhat Linux 7.1</ENTRY>
<ENTRY ALIGN="RIGHT">0</ENTRY></ROW>
<ROW><ENTRY>Officepakke</ENTRY>
<ENTRY ALIGN="RIGHT">0</ENTRY></ROW>
<ROW><ENTRY>Server</ENTRY>
<ENTRY ALIGN="RIGHT"></ENTRY></ROW>
<ROW><ENTRY>Redhat Linux 7.1 professionel server</ENTRY>
<ENTRY ALIGN="RIGHT">2.288</ENTRY></ROW></TBODY></TGROUP></TABLE>
<PARA>Det skal bem&aelig;rkes, at for linuxalternativet vil TCO ikke &aelig;ndre sig med antallet af installerede arbejdsstationer, mens TCO for windows vedkommende vil v&aelig;re proportionalt stigenden med antallet af arbejdsstationer.</PARA></SECT1></CHAPTER>

